Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp
#include "dfr1154_cam_controller.h"

#include <Arduino.h>
#include <ArduinoOTA.h>
#include <DFRobot_LTR308.h>
#include <ESPmDNS.h>
#include <Preferences.h>
#include <PubSubClient.h>
#include <WiFi.h>
#include <WiFiClient.h>
#include <WiFiServer.h>
#include <Wire.h>
#include <esp_camera.h>
#include <math.h>
#include <memory>
#include <stdarg.h>
#include <stdio.h>
#include <string.h>
#include <time.h>

#include "dfr1154_config.h"
#include "dfr1154_pins.h"
#include "dfr1154_timelapse.h"
#include "esp32_rtsp_streamer.h"

namespace {

WiFiServer g_rtspServer(dfrcfg::kRtspPort);
WiFiClient g_mqttSocket;
PubSubClient g_mqttClient(g_mqttSocket);
Preferences g_preferences;
DFRobot_LTR308 g_lightSensor;
std::unique_ptr<Esp32RtspStreamer> g_streamer;

bool g_cameraReady = false;
bool g_psramReady = false;
bool g_lightReady = false;
bool g_wifiStarted = false;
bool g_rtspServerStarted = false;
bool g_mdnsReady = false;
bool g_timeConfigured = false;
bool g_streamEnabled = true;
bool g_networkServicesPending = false;

framesize_t g_frameSize = FRAMESIZE_SVGA;
int g_jpegQuality = 10;
int g_brightness = 1;
int g_contrast = 0;
int g_saturation = -2;
int g_sharpness = 0;
int g_hmirror = 0;
int g_vflip = 1;
int g_ledEnabled = 0;
int g_streamFps = dfrcfg::kDefaultRtspFps;

// 0 = off, 1 = on, 2 = automatic from the LTR-308.
int g_irMode = 2;
bool g_irEnabled = false;
float g_irOnBelowLux = dfrcfg::kDefaultIrOnBelowLux;
float g_irOffAboveLux = dfrcfg::kDefaultIrOffAboveLux;
float g_ambientLux = NAN;

String g_lastStatus = "booting";
String g_lastError;
uint32_t g_lastWifiAttemptMs = 0;
uint32_t g_lastMqttAttemptMs = 0;
uint32_t g_lastFrameAtMs = 0;
uint32_t g_lastStatsMs = 0;
uint32_t g_lastLightReadMs = 0;
uint32_t g_framesSent = 0;
float g_lastMeasuredFps = 0.0f;

int clampValue(int value, int minimum, int maximum) {
  return value < minimum ? minimum : (value > maximum ? maximum : value);
}

String uint64String(uint64_t value) {
  char buffer[24];
  snprintf(buffer, sizeof(buffer), "%llu", static_cast<unsigned long long>(value));
  return String(buffer);
}

String mqttTopic(const char *suffix) {
  return String(dfrcfg::kMqttBaseTopic) + "/" + suffix;
}

int directSessionCount() {
  return g_streamer != nullptr ? g_streamer->sessionCount() : 0;
}

int directStreamingSessionCount() {
  return g_streamer != nullptr ? g_streamer->streamingSessionCount() : 0;
}

const char *frameSizeName() {
  switch (g_frameSize) {
    case FRAMESIZE_QVGA: return "QVGA";
    case FRAMESIZE_VGA: return "VGA";
    case FRAMESIZE_SVGA: return "SVGA";
    case FRAMESIZE_XGA: return "XGA";
    case FRAMESIZE_HD: return "HD";
    case FRAMESIZE_SXGA: return "SXGA";
    case FRAMESIZE_UXGA: return "UXGA";
    case FRAMESIZE_QXGA: return "QXGA";
    default: return "OTHER";
  }
}

framesize_t frameSizeFromIndex(int index) {
  switch (index) {
    case 0: return FRAMESIZE_QVGA;
    case 1: return FRAMESIZE_VGA;
    case 2: return FRAMESIZE_SVGA;
    case 3: return FRAMESIZE_XGA;
    case 4: return FRAMESIZE_HD;
    case 5: return FRAMESIZE_SXGA;
    case 6: return FRAMESIZE_UXGA;
    case 7: return FRAMESIZE_QXGA;
    default: return g_frameSize;
  }
}

int frameSizeToIndex(framesize_t size) {
  switch (size) {
    case FRAMESIZE_QVGA: return 0;
    case FRAMESIZE_VGA: return 1;
    case FRAMESIZE_SVGA: return 2;
    case FRAMESIZE_XGA: return 3;
    case FRAMESIZE_HD: return 4;
    case FRAMESIZE_SXGA: return 5;
    case FRAMESIZE_UXGA: return 6;
    case FRAMESIZE_QXGA: return 7;
    default: return 2;
  }
}

const char *irModeName() {
  switch (g_irMode) {
    case 0: return "off";
    case 1: return "on";
    default: return "auto";
  }
}

String rtspUrl() {
  if (WiFi.status() != WL_CONNECTED) return "";
  return "rtsp://" + WiFi.localIP().toString() + ":" + String(dfrcfg::kRtspPort) + "/" +
         dfrcfg::kRtspPresentation + "/" + dfrcfg::kRtspStream;
}

String archiveUrl() {
  if (WiFi.status() != WL_CONNECTED) return "";
  return "http://" + WiFi.localIP().toString() + ":" + String(dfrcfg::kArchivePort);
}

String streamState() {
  if (!g_cameraReady) return "camera_error";
  if (WiFi.status() != WL_CONNECTED) return "wifi_down";
  if (!g_streamEnabled) return "paused";
  return directStreamingSessionCount() > 0 ? "streaming" : "ready";
}

void publishStatus(bool forceConfig = false);

void recordStatus(const String &message) {
  g_lastStatus = message;
  Serial.printf("[STAT] %s\n", message.c_str());
}

void statusf(const char *format, ...) {
  char buffer[192];
  va_list args;
  va_start(args, format);
  vsnprintf(buffer, sizeof(buffer), format, args);
  va_end(args);
  recordStatus(buffer);
}

void setError(const String &message) {
  if (g_lastError == message) return;
  g_lastError = message;
  Serial.printf("[ERROR] %s\n", message.c_str());
  publishStatus();
}

void clearError() {
  if (g_lastError.length() == 0) return;
  g_lastError = "";
  publishStatus();
}

void applyLedState(bool enabled) {
  g_ledEnabled = enabled ? 1 : 0;
  digitalWrite(DFR_LED_PIN, enabled ? HIGH : LOW);
}

void applyIrState(bool enabled) {
  if (g_irEnabled == enabled) return;
  g_irEnabled = enabled;
  digitalWrite(DFR_IR_PIN, enabled ? HIGH : LOW);
  statusf("ir %s mode=%s lux=%.2f", enabled ? "on" : "off", irModeName(), g_ambientLux);
}

void evaluateIrAutomation() {
  if (g_irMode == 0) {
    applyIrState(false);
    return;
  }
  if (g_irMode == 1) {
    applyIrState(true);
    return;
  }
  if (!g_lightReady || !isfinite(g_ambientLux)) return;

  if (!g_irEnabled && g_ambientLux <= g_irOnBelowLux) {
    applyIrState(true);
  } else if (g_irEnabled && g_ambientLux >= g_irOffAboveLux) {
    applyIrState(false);
  }
}

void handleLightSensor() {
  if (!g_lightReady) return;
  const uint32_t now = millis();
  if (now - g_lastLightReadMs < dfrcfg::kLightReadIntervalMs) return;
  g_lastLightReadMs = now;

  const uint32_t raw = g_lightSensor.getData();
  const double lux = g_lightSensor.getLux(raw);
  if (isfinite(lux) && lux >= 0.0) g_ambientLux = static_cast<float>(lux);
  evaluateIrAutomation();
}

void observeJpegFrame(
    const uint8_t *data,
    size_t length,
    uint16_t width,
    uint16_t height,
    uint32_t capturedAtMs) {
  dfrtimelapse::observeJpegFrame(data, length, width, height, capturedAtMs);
}

