Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp
bool initCamera() {
  g_psramReady = psramFound();
  if (!g_psramReady) {
    setError("DFR1154 PSRAM not detected");
    return false;
  }

  camera_config_t config = {};
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = DFR_CAM_Y2;
  config.pin_d1 = DFR_CAM_Y3;
  config.pin_d2 = DFR_CAM_Y4;
  config.pin_d3 = DFR_CAM_Y5;
  config.pin_d4 = DFR_CAM_Y6;
  config.pin_d5 = DFR_CAM_Y7;
  config.pin_d6 = DFR_CAM_Y8;
  config.pin_d7 = DFR_CAM_Y9;
  config.pin_xclk = DFR_CAM_XCLK;
  config.pin_pclk = DFR_CAM_PCLK;
  config.pin_vsync = DFR_CAM_VSYNC;
  config.pin_href = DFR_CAM_HREF;
  config.pin_sccb_sda = DFR_CAM_SIOD;
  config.pin_sccb_scl = DFR_CAM_SIOC;
  config.pin_pwdn = DFR_CAM_PWDN;
  config.pin_reset = DFR_CAM_RESET;
  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;
  config.frame_size = g_frameSize;
  config.jpeg_quality = g_jpegQuality;
  config.fb_count = 2;
  config.fb_location = CAMERA_FB_IN_PSRAM;
  config.grab_mode = CAMERA_GRAB_LATEST;

  const esp_err_t result = esp_camera_init(&config);
  if (result != ESP_OK) {
    setError("camera init failed: 0x" + String(static_cast<uint32_t>(result), HEX));
    return false;
  }

  g_cameraReady = true;
  applySensorSettings(false);
  statusf("camera ready sensor=OV3660 psram=%luMB frame=%s", ESP.getPsramSize() / (1024UL * 1024UL), frameSizeName());
  return true;
}

void configureLightSensor() {
  // DFRobot requires camera initialization before starting the shared SCCB/I2C bus.
  g_lightReady = g_lightSensor.begin();
  if (!g_lightReady) {
    recordStatus("LTR-308 light sensor unavailable; IR auto mode suspended");
    return;
  }
  g_lightSensor.setMeasurementRate(
      DFRobot_LTR308::eConversion_100ms_18b,
      DFRobot_LTR308::eRate_500ms);
  statusf("LTR-308 ready");
}

void configureOta() {
  ArduinoOTA.setHostname(dfrcfg::kOtaHostname);
  if (strlen(dfrcfg::kOtaPassword) > 0) ArduinoOTA.setPassword(dfrcfg::kOtaPassword);
  ArduinoOTA.onStart([]() { recordStatus("ota update started"); });
  ArduinoOTA.onEnd([]() { recordStatus("ota update finished"); });
  ArduinoOTA.onError([](ota_error_t error) {
    setError("ota error=" + String(static_cast<uint32_t>(error)));
  });
  ArduinoOTA.begin();
  statusf("ota ready host=%s", dfrcfg::kOtaHostname);
}

void configureMdns() {
  if (g_mdnsReady || WiFi.status() != WL_CONNECTED) return;
  if (!MDNS.begin(dfrcfg::kMdnsHostname)) {
    recordStatus("mdns setup failed");
    return;
  }
  MDNS.addService("arduino", "tcp", 3232);
  MDNS.addService("rtsp", "tcp", dfrcfg::kRtspPort);
  MDNS.addService("http", "tcp", dfrcfg::kArchivePort);
  g_mdnsReady = true;
}

void onWifiEvent(WiFiEvent_t event, WiFiEventInfo_t info) {
  switch (event) {
    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
      statusf("wifi ip=%s", WiFi.localIP().toString().c_str());
      if (!g_timeConfigured) {
        configTzTime(dfrcfg::kTimezone, dfrcfg::kNtpServer1, dfrcfg::kNtpServer2);
        g_timeConfigured = true;
      }
      g_networkServicesPending = true;
      break;
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
      statusf("wifi disconnected reason=%d", info.wifi_sta_disconnected.reason);
      g_streamer.reset();
      MDNS.end();
      g_mdnsReady = false;
      g_networkServicesPending = false;
      break;
    default:
      break;
  }
}

void handleNetworkServices() {
  if (!g_networkServicesPending || WiFi.status() != WL_CONNECTED) return;
  g_networkServicesPending = false;
  configureMdns();
  ensureRtspServer();
  dfrtimelapse::startHttpServer();
  rebuildStreamer();
}

void ensureWifi() {
  if (WiFi.status() == WL_CONNECTED) return;
  const uint32_t now = millis();
  if (now - g_lastWifiAttemptMs < dfrcfg::kWifiRetryMs) return;
  g_lastWifiAttemptMs = now;

  if (!g_wifiStarted) {
    g_wifiStarted = true;
    statusf("wifi connecting ssid=%s", dfrcfg::kWifiSsid);
    WiFi.begin(dfrcfg::kWifiSsid, dfrcfg::kWifiPassword);
  } else {
    WiFi.reconnect();
  }
}

bool extractPayloadToken(const String &payload, const String &key, String &token) {
  const String jsonKey = "\"" + key + "\"";
  int keyPosition = payload.indexOf(jsonKey);
  if (keyPosition < 0) return false;
  int colon = payload.indexOf(':', keyPosition + jsonKey.length());
  if (colon < 0) return false;

  int start = colon + 1;
  while (start < payload.length() && isspace(static_cast<unsigned char>(payload[start]))) ++start;
  if (start >= payload.length()) return false;

  if (payload[start] == '"') {
    const int end = payload.indexOf('"', start + 1);
    if (end < 0) return false;
    token = payload.substring(start + 1, end);
    return true;
  }

  int end = start;
  while (end < payload.length() && payload[end] != ',' && payload[end] != '}') ++end;
  token = payload.substring(start, end);
  token.trim();
  return token.length() > 0;
}

bool extractPayloadInt(const String &payload, const char *key, int &value) {
  String token;
  if (!extractPayloadToken(payload, key, token)) return false;
  token.toLowerCase();
  if (token == "true" || token == "on") {
    value = 1;
    return true;
  }
  if (token == "false" || token == "off") {
    value = 0;
    return true;
  }
  value = token.toInt();
  return true;
}

bool applySetting(const char *key, int value, bool &rebuildRequired) {
  sensor_t *sensor = esp_camera_sensor_get();
  if (strcmp(key, "framesize") == 0) {
    g_frameSize = frameSizeFromIndex(clampValue(value, 0, 7));
    if (sensor) sensor->set_framesize(sensor, g_frameSize);
    rebuildRequired = true;
  } else if (strcmp(key, "jpeg_quality") == 0) {
    g_jpegQuality = clampValue(value, 4, 63);
    if (sensor) sensor->set_quality(sensor, g_jpegQuality);
  } else if (strcmp(key, "stream_fps") == 0) {
    g_streamFps = clampValue(value, 1, 20);
  } else if (strcmp(key, "brightness") == 0) {
    g_brightness = clampValue(value, -2, 2);
    if (sensor) sensor->set_brightness(sensor, g_brightness);
  } else if (strcmp(key, "contrast") == 0) {
    g_contrast = clampValue(value, -2, 2);
    if (sensor) sensor->set_contrast(sensor, g_contrast);
  } else if (strcmp(key, "saturation") == 0) {
    g_saturation = clampValue(value, -2, 2);
    if (sensor) sensor->set_saturation(sensor, g_saturation);
  } else if (strcmp(key, "sharpness") == 0) {
    g_sharpness = clampValue(value, -2, 2);
    if (sensor) sensor->set_sharpness(sensor, g_sharpness);
  } else if (strcmp(key, "hmirror") == 0) {
    g_hmirror = value ? 1 : 0;
    if (sensor) sensor->set_hmirror(sensor, g_hmirror);
  } else if (strcmp(key, "vflip") == 0) {
    g_vflip = value ? 1 : 0;
    if (sensor) sensor->set_vflip(sensor, g_vflip);
  } else if (strcmp(key, "led") == 0) {
    applyLedState(value != 0);
  } else if (strcmp(key, "stream_enabled") == 0) {
    g_streamEnabled = value != 0;
    rebuildRequired = true;
  } else if (strcmp(key, "ir_mode") == 0) {
    g_irMode = clampValue(value, 0, 2);
    evaluateIrAutomation();
  } else if (strcmp(key, "ir_on_lux") == 0) {
    g_irOnBelowLux = static_cast<float>(clampValue(value, 0, 100000));
    if (g_irOffAboveLux <= g_irOnBelowLux) g_irOffAboveLux = g_irOnBelowLux + 2.0f;
    evaluateIrAutomation();
  } else if (strcmp(key, "ir_off_lux") == 0) {
    g_irOffAboveLux = static_cast<float>(clampValue(value, 1, 100000));
    if (g_irOffAboveLux <= g_irOnBelowLux) g_irOnBelowLux = max(0.0f, g_irOffAboveLux - 2.0f);
    evaluateIrAutomation();
  } else if (strcmp(key, "timelapse_enabled") == 0) {
    dfrtimelapse::setEnabled(value != 0);
  } else if (strcmp(key, "timelapse_interval_seconds") == 0) {
    dfrtimelapse::setIntervalSeconds(static_cast<uint32_t>(max(5, value)));
  } else if (strcmp(key, "timelapse_limit_gb") == 0) {
    dfrtimelapse::setStorageLimitBytes(static_cast<uint64_t>(max(1, value)) * 1024ULL * 1024ULL * 1024ULL);
  } else {
    return false;
  }
  return true;
}

void applyControlPayload(const String &payload) {
  static const char *keys[] = {
      "framesize", "jpeg_quality", "stream_fps", "brightness", "contrast", "saturation",
      "sharpness", "hmirror", "vflip", "led", "stream_enabled", "ir_mode", "ir_on_lux",
      "ir_off_lux", "timelapse_enabled", "timelapse_interval_seconds", "timelapse_limit_gb"};

  bool changed = false;
  bool rebuildRequired = false;
  for (const char *key : keys) {
    int value = 0;
    if (extractPayloadInt(payload, key, value) && applySetting(key, value, rebuildRequired)) changed = true;
  }

